[
  {
    "title": "Nike Men's Vapor Elite 2 Jersey",
    "category": "Apparel",
    "priceUSD": 89.99,
    "inventory": 45,
    "sku": "AP-NIKE-VAPOR-ELITE-JER",
    "imageUrl": "/sample/product-images/AP-NIKE-VAPOR-ELITE-JER.jpg",
    "shortDescription": "Professional-grade baseball jersey with moisture-wicking technology.",
    "longDescription": "The Nike Vapor Elite 2 Jersey delivers premium performance for serious baseball players. Featuring Nike's advanced Dri-FIT technology, this jersey keeps you cool and dry during intense games. The streamlined fit reduces drag while allowing full range of motion, and the durable construction withstands the rigors of competitive play. Designed with input from MLB players, it combines authentic team styling with cutting-edge fabric technology for unmatched comfort on the diamond."
  },
  {
    "title": "Under Armour Men's Leadoff Baseball Pants",
    "category": "Apparel",
    "priceUSD": 39.99,
    "inventory": 78,
    "sku": "AP-UA-LEADOFF-PANTS",
    "imageUrl": "/sample/product-images/AP-UA-LEADOFF-PANTS.jpg",
    "shortDescription": "Classic fit baseball pants with reinforced knees and belt loops.",
    "longDescription": "Under Armour's Leadoff Baseball Pants are built for players who demand durability and comfort. The light, durable fabric stretches with your movements while maintaining its shape game after game. Double-reinforced knees provide extra protection during slides, and the tunnel belt loop system works with most belts for a secure fit."
  },
  {
    "title": "New Era 59FIFTY Fitted Baseball Cap",
    "category": "Apparel",
    "priceUSD": 44.99,
    "inventory": 120,
    "sku": "AP-NE-59FIFTY-CAP",
    "imageUrl": "/sample/product-images/AP-NE-59FIFTY-CAP.jpg",
    "shortDescription": "Authentic on-field fitted cap with structured crown and flat brim.",
    "longDescription": "The New Era 59FIFTY is the official on-field cap of Major League Baseball and the gold standard for fitted baseball caps. Its structured, fitted design maintains its shape while providing a professional look that's been trusted by players and fans for decades. Made with premium materials, it features a moisture-wicking sweatband to keep you comfortable."
  },
  {
    "title": "Majestic Cool Base Replica Jersey",
    "category": "Apparel",
    "priceUSD": 119.99,
    "inventory": 34,
    "sku": "AP-MAJ-COOLBASE-REP",
    "imageUrl": "/sample/product-images/AP-MAJ-COOLBASE-REP.jpg",
    "shortDescription": "Official MLB replica jersey with Cool Base moisture management.",
    "longDescription": "The Majestic Cool Base Replica Jersey brings authentic MLB styling to fans and players alike. Featuring the same Cool Base technology used in on-field jerseys, this replica offers superior moisture management and temperature control. The tackle twill team logos and player numbers are sewn on for durability and authentic appearance."
  },
  {
    "title": "Wilson A2000 Baseball Glove (11.5 inch)",
    "category": "Gear",
    "priceUSD": 289.99,
    "inventory": 18,
    "sku": "GR-WIL-A2000-11.5",
    "imageUrl": "/sample/product-images/GR-WIL-A2000-11.5.jpg",
    "shortDescription": "Premium leather infield glove with Pro Stock patterns.",
    "longDescription": "The Wilson A2000 is the most popular glove among professional baseball players, trusted by more pros than any other model. Handcrafted from premium Pro Stock leather, each glove is built to provide exceptional feel and durability. The 11.5-inch infield pattern offers the perfect pocket depth for quick transfers, while the Dual Welting technology reinforces the pocket for maximum stability."
  },
  {
    "title": "Rawlings Heart of the Hide Catcher's Mitt",
    "category": "Gear",
    "priceUSD": 349.99,
    "inventory": 0,
    "sku": "GR-RAW-HOH-CATCH",
    "imageUrl": "/sample/product-images/GR-RAW-HOH-CATCH.jpg",
    "shortDescription": "Elite catcher's mitt made from select Heart of the Hide leather.",
    "longDescription": "Rawlings Heart of the Hide represents the pinnacle of baseball glove craftsmanship, featuring ultra-premium steer hide leather from the top 5% of hides. This catcher's mitt is designed for serious backstops who demand the best protection and control behind the plate. Currently Out of Stock - High Demand Item."
  },
  {
    "title": "Easton Ghost Double Barrel BBCOR Bat",
    "category": "Gear",
    "priceUSD": 399.99,
    "inventory": 24,
    "sku": "GR-EAST-GHOST-BBCOR",
    "imageUrl": "/sample/product-images/GR-EAST-GHOST-BBCOR.jpg",
    "shortDescription": "High-performance BBCOR baseball bat with revolutionary double barrel construction.",
    "longDescription": "The Easton Ghost Double Barrel redefines what's possible in BBCOR bat performance. Featuring revolutionary Double Barrel technology that combines inner and outer barrels to create the largest sweet spot in Easton history, this bat delivers explosive power across the entire hitting surface. BBCOR certified for high school and college regulations."
  },
  {
    "title": "Louisville Slugger MLB Prime Maple Wood Bat",
    "category": "Gear",
    "priceUSD": 149.99,
    "inventory": 32,
    "sku": "GR-LS-MAPLE-C271",
    "imageUrl": "/sample/product-images/GR-LS-MAPLE-C271.jpg",
    "shortDescription": "Pro-grade maple wood bat with traditional C271 profile used by MLB stars.",
    "longDescription": "Louisville Slugger has been crafting legendary baseball bats since 1884, and the MLB Prime Maple continues that tradition of excellence. Made from top-grade maple wood selected for its superior hardness and durability, this bat features the C271 turning model that's been used by countless big league players."
  },
  {
    "title": "Diamond iX3 Baseball (DOZ)",
    "category": "Gear",
    "priceUSD": 54.99,
    "inventory": 156,
    "sku": "GR-DIA-IX3-DOZ",
    "imageUrl": "/sample/product-images/GR-DIA-IX3-DOZ.jpg",
    "shortDescription": "Premium raised seam baseballs for competitive play and practice (1 dozen).",
    "longDescription": "Diamond iX3 baseballs deliver consistent performance that serious teams demand for both games and practice. Each ball features a cushioned cork center for optimal resilience and performance, wrapped with wool and cotton windings, and covered with premium full-grain leather. These NFHS certified baseballs maintain their shape and performance through multiple innings of play."
  },
  {
    "title": "Mizuno Classic Pro Soft Baseball Glove (12 inch)",
    "category": "Gear",
    "priceUSD": 199.99,
    "inventory": 28,
    "sku": "GR-MIZ-CLASSIC-12",
    "imageUrl": "/sample/product-images/GR-MIZ-CLASSIC-12.jpg",
    "shortDescription": "Professional-quality outfield glove with deep pocket design.",
    "longDescription": "Mizuno's Classic Pro Soft series represents decades of Japanese glove-making expertise, offering players a perfectly balanced combination of soft feel and structural integrity. The 12-inch pattern is ideal for outfielders who need a deep pocket to secure fly balls, while the Bio Soft leather breaks in quickly without sacrificing durability."
  },
  {
    "title": "Nike Alpha Huarache Elite 4 Mid Baseball Cleats",
    "category": "Shoes",
    "priceUSD": 89.99,
    "inventory": 67,
    "sku": "SH-NIKE-HUARACHE-MID",
    "imageUrl": "/sample/product-images/SH-NIKE-HUARACHE-MID.jpg",
    "shortDescription": "Mid-cut baseball cleats with responsive cushioning and elite traction.",
    "longDescription": "The Nike Alpha Huarache Elite 4 Mid is engineered for explosive performance on the diamond. Featuring Nike React foam technology in the midsole, these cleats provide responsive cushioning that returns energy with every step. The mid-cut collar design offers ankle support without restricting mobility, perfect for quick direction changes."
  },
  {
    "title": "New Balance FuelCell 4040 v7 Metal Baseball Cleats",
    "category": "Shoes",
    "priceUSD": 139.99,
    "inventory": 42,
    "sku": "SH-NB-4040V7-METAL",
    "imageUrl": "/sample/product-images/SH-NB-4040V7-METAL.jpg",
    "shortDescription": "High-performance metal cleats with FuelCell cushioning technology.",
    "longDescription": "The New Balance FuelCell 4040 v7 represents the cutting edge of baseball cleat technology, combining lightweight construction with explosive energy return. FuelCell midsole technology provides elite cushioning that propels you forward with every stride, while the metal spike configuration is optimized for maximum traction and acceleration."
  },
  {
    "title": "Under Armour Yard Low MT Baseball Cleats",
    "category": "Shoes",
    "priceUSD": 79.99,
    "inventory": 88,
    "sku": "SH-UA-YARD-LOW-MT",
    "imageUrl": "/sample/product-images/SH-UA-YARD-LOW-MT.jpg",
    "shortDescription": "Versatile molded turf cleats for multi-surface play and training.",
    "longDescription": "Under Armour's Yard Low MT cleats are designed for players who need versatility and durability across multiple surfaces. The low-cut design allows for natural ankle mobility and lighter weight, while the molded rubber studs provide reliable traction on turf, dirt, and grass. The Charged Cushioning midsole absorbs impact and converts it to responsive energy."
  },
  {
    "title": "Adidas Icon 7 Bounce Baseball Cleats",
    "category": "Shoes",
    "priceUSD": 94.99,
    "inventory": 55,
    "sku": "SH-ADI-ICON7-BOUNCE",
    "imageUrl": "/sample/product-images/SH-ADI-ICON7-BOUNCE.jpg",
    "shortDescription": "Premium baseball cleats with Bounce cushioning and lockdown fit.",
    "longDescription": "The Adidas Icon 7 Bounce combines innovative cushioning technology with a sleek, performance-driven design. Bounce midsole cushioning provides responsive comfort that adapts to your playing style. The Sprintframe TPU outsole is engineered for optimal weight distribution and traction, while the Ironskin synthetic leather toe cap offers enhanced durability."
  },
  {
    "title": "Franklin Sports Baseball Batting Gloves",
    "category": "Accessories",
    "priceUSD": 29.99,
    "inventory": 145,
    "sku": "AC-FRANK-BAT-GLOVES",
    "imageUrl": "/sample/product-images/AC-FRANK-BAT-GLOVES.jpg",
    "shortDescription": "Digi-Tek batting gloves with superior grip and flexibility.",
    "longDescription": "Franklin Sports has been outfitting baseball players for over 70 years, and these Digi-Tek batting gloves represent the perfect blend of comfort, grip, and durability. The digitally embossed palm provides exceptional bat grip in all weather conditions, while the four-way stretch mesh back ensures a flexible, breathable fit."
  },
  {
    "title": "EvoShield PRO-SRZ Batter's Leg Guard",
    "category": "Accessories",
    "priceUSD": 49.99,
    "inventory": 72,
    "sku": "AC-EVO-LEG-GUARD",
    "imageUrl": "/sample/product-images/AC-EVO-LEG-GUARD.jpg",
    "shortDescription": "Custom-molding leg guard for batters with Gel-to-Shell technology.",
    "longDescription": "The EvoShield PRO-SRZ Leg Guard uses revolutionary Gel-to-Shell technology that custom-molds to your leg for a perfect, personalized fit. Within 30 minutes of opening the package, the protective shield hardens to create a lightweight, low-profile guard that won't restrict your movement in the batter's box."
  },
  {
    "title": "Champro Baseball Helmet with Faceguard",
    "category": "Accessories",
    "priceUSD": 64.99,
    "inventory": 0,
    "sku": "AC-CHAMP-HELMET-FG",
    "imageUrl": "/sample/product-images/AC-CHAMP-HELMET-FG.jpg",
    "shortDescription": "NOCSAE certified batting helmet with attached wire faceguard.",
    "longDescription": "Safety meets performance in the Champro Baseball Helmet with Faceguard, designed to provide maximum protection for batters and base runners. The high-impact ABS shell is NOCSAE certified and meets all safety standards for competitive play. The steel wire faceguard is permanently attached and engineered to protect against wild pitches. Currently Out of Stock - Awaiting New Shipment."
  },
  {
    "title": "Rawlings Velo Wheeled Baseball Bag",
    "category": "Accessories",
    "priceUSD": 119.99,
    "inventory": 38,
    "sku": "AC-RAW-VELO-WHEEL",
    "imageUrl": "/sample/product-images/AC-RAW-VELO-WHEEL.jpg",
    "shortDescription": "Premium wheeled equipment bag with multiple compartments and durable construction.",
    "longDescription": "The Rawlings Velo Wheeled Baseball Bag is the ultimate equipment hauler for serious players who need to transport their gear in style and comfort. This spacious bag features a main compartment large enough for helmets, gloves, and uniforms, plus separate ventilated shoe and dirty gear pockets to keep things organized."
  },
  {
    "title": "Stance Baseball Diamond Pro OTC Socks",
    "category": "Accessories",
    "priceUSD": 19.99,
    "inventory": 210,
    "sku": "AC-STANCE-DIAMOND-PRO",
    "imageUrl": "/sample/product-images/AC-STANCE-DIAMOND-PRO.jpg",
    "shortDescription": "Performance baseball socks with moisture-wicking and arch support.",
    "longDescription": "Stance Diamond Pro OTC socks are engineered specifically for baseball players who demand comfort and performance from every piece of their uniform. The over-the-calf design provides full coverage under stirrups or for a classic baseball look, while the moisture-wicking blend keeps your feet dry during the longest games."
  },
  {
    "title": "Shock Doctor Core Compression Shorts with Bio-Flex Cup",
    "category": "Accessories",
    "priceUSD": 34.99,
    "inventory": 95,
    "sku": "AC-SHOCK-COMP-CUP",
    "imageUrl": "/sample/product-images/AC-SHOCK-COMP-CUP.jpg",
    "shortDescription": "Compression shorts with integrated protective cup pocket and moisture-wicking fabric.",
    "longDescription": "The Shock Doctor Core Compression Shorts provide essential protection and performance for baseball players. Featuring a built-in pocket that securely holds the included Bio-Flex protective cup, these shorts eliminate shifting and ensure consistent protection throughout the game. The compression fabric supports muscles, reduces fatigue, and wicks moisture away to keep you dry and comfortable. The soft cup design flexes with your movement while providing rigid protection where you need it most. Perfect for players at all levels who prioritize safety without sacrificing mobility."
  },
  {
    "title": "McDavid Flex Cup Athletic Supporter",
    "category": "Accessories",
    "priceUSD": 24.99,
    "inventory": 118,
    "sku": "AC-MCD-FLEX-SUP",
    "imageUrl": "/sample/product-images/AC-MCD-FLEX-SUP.jpg",
    "shortDescription": "Traditional athletic supporter with flex shield protective cup.",
    "longDescription": "McDavid's Flex Cup Athletic Supporter offers classic jockstrap design with modern protective technology. The flex shield cup is constructed from high-impact resistant material that disperses force upon impact while maintaining flexibility for natural movement. The supporter features a comfortable waistband with no-slip gripper strips and durable elastic leg straps that keep the cup securely in place during aggressive play. Moisture-wicking fabric keeps you dry, and the mesh ventilation panels provide breathability. Essential protection for batters, catchers, and infielders who face high-speed pitches and hard-hit balls. Trusted by players for decades as fundamental protective gear."
  },
  {
    "title": "Rawlings Official League Practice Baseball (DOZ)",
    "category": "Gear",
    "priceUSD": 39.99,
    "inventory": 185,
    "sku": "GR-RAW-OL-REC-DOZ",
    "imageUrl": "/sample/product-images/GR-RAW-OL-REC-DOZ.jpg",
    "shortDescription": "Value-priced practice baseballs for recreational play (1 dozen).",
    "longDescription": "Rawlings Official League Practice baseballs offer excellent value for teams, coaches, and players who need quality practice balls without breaking the budget. Each ball features a cushioned cork center and synthetic leather cover that provides good durability for batting practice and recreational games. With a dozen balls included, you'll have plenty for extended training sessions."
  },
  {
    "title": "DeMarini CF Zen BBCOR Baseball Bat",
    "category": "Gear",
    "priceUSD": 449.99,
    "inventory": 16,
    "sku": "GR-DEMA-CF-ZEN-BBCOR",
    "imageUrl": "/sample/product-images/GR-DEMA-CF-ZEN-BBCOR.jpg",
    "shortDescription": "Elite BBCOR bat with Paraflex Plus composite barrel for maximum performance.",
    "longDescription": "The DeMarini CF Zen is consistently rated as one of the best BBCOR bats on the market, combining cutting-edge composite technology with a perfectly balanced swing weight. The Paraflex Plus composite barrel creates a massive sweet spot with exceptional responsiveness, while the 3Fusion Connection system joins the handle to the barrel to reduce vibration."
  },
  {
    "title": "Marucci CAT9 BBCOR Baseball Bat",
    "category": "Gear",
    "priceUSD": 349.99,
    "inventory": 0,
    "sku": "GR-MAR-CAT9-BBCOR",
    "imageUrl": "/sample/product-images/GR-MAR-CAT9-BBCOR.jpg",
    "shortDescription": "One-piece aluminum bat with AZ105 alloy and precision-balanced barrel.",
    "longDescription": "The Marucci CAT9 represents the pinnacle of aluminum bat engineering, utilizing aerospace-grade AZ105 alloy for maximum pop and durability. The precision-balanced AV2 Anti-Vibration Knob drastically reduces hand sting on mishits, while the multi-variable wall design creates a wider sweet spot. Currently Out of Stock - New Shipment Expected Soon."
  },
  {
    "title": "Rawlings Pro Preferred Outfield Glove (12.75 inch)",
    "category": "Gear",
    "priceUSD": 429.99,
    "inventory": 9,
    "sku": "GR-RAW-PROPREF-1275",
    "imageUrl": "/sample/product-images/GR-RAW-PROPREF-1275.jpg",
    "shortDescription": "Premium outfield glove with Kip leather and deep pocket design.",
    "longDescription": "The Rawlings Pro Preferred series represents the absolute finest gloves available, crafted from 100% Kip leather that's tanned to Rawlings' exact specifications. This 12.75-inch outfield pattern provides the deep pocket and reach that elite outfielders need to track down fly balls in the gap. Each glove is individually crafted by master glove makers."
  },
  {
    "title": "Akadema ProSoft Elite Baseball Glove (11.25 inch)",
    "category": "Gear",
    "priceUSD": 159.99,
    "inventory": 45,
    "sku": "GR-AKA-PROSOFT-1125",
    "imageUrl": "/sample/product-images/GR-AKA-PROSOFT-1125.jpg",
    "shortDescription": "Versatile infield pitcher glove with game-ready feel out of the box.",
    "longDescription": "Akadema's ProSoft Elite series offers exceptional value for players who want professional-quality leather without the extensive break-in period. The 11.25-inch pattern is versatile enough for middle infielders and pitchers, providing a shallow pocket for quick ball transfer while maintaining enough depth for secure catching."
  },
  {
    "title": "Schutt F7 Baseball Batter's Helmet",
    "category": "Accessories",
    "priceUSD": 89.99,
    "inventory": 52,
    "sku": "AC-SCHUTT-F7-HELMET",
    "imageUrl": "/sample/product-images/AC-SCHUTT-F7-HELMET.jpg",
    "shortDescription": "Advanced protection batting helmet with TPU cushioning system.",
    "longDescription": "The Schutt F7 Baseball Helmet sets a new standard for head protection in baseball. Featuring TPU cushioning that absorbs and disperses impact energy more effectively than traditional foam, this helmet provides elite protection without adding weight. The sleek, aerodynamic design reduces drag, while strategically placed vents keep you cool during at-bats."
  }
]
